import { FunctionComponent } from "react";
import NavBar from "../components/Interface/NavBar";
import ContentCard from "../components/ContentsCard/ContentCard";
import { GridLayoutDiv } from "../components/layout/Layout.style";

const MainPage: FunctionComponent = function () {
  return (
    <div style={{ display: "flex" }}>
      <NavBar />
      <div style={{ overflowY: 'scroll', height: '100vh' }}>
        <GridLayoutDiv>
          <ContentCard
            writer={"jaehyun"}
            date={"2023-10-05-Thu"}
            contentTitle={"새로운 회계연도가 개시될 때까지"}
            contentBody={
              "새로운 회계연도가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 예산안이 의결될 때까지 다음의 목적을 위한 경비는 전년도 예산에 준하여 집행할 수 있다. 국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 대통령은 전시·사변 또는 이에 준하는 국가비상사태에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 안녕질서를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 계엄을 선포할 수 있다."
            }
            imgArray={3}
          />
          <ContentCard
            writer={"jaehyun"}
            date={"2023-10-05-Thu"}
            contentTitle={"새로운 회계연도가 개시될 때까지"}
            contentBody={
              "새로운 회계연도가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 예산안이 의결될 때까지 다음의 목적을 위한 경비는 전년도 예산에 준하여 집행할 수 있다. 국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 대통령은 전시·사변 또는 이에 준하는 국가비상사태에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 안녕질서를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 계엄을 선포할 수 있다."
            }
            imgArray={3}
          />
          <ContentCard
            writer={"jaehyun"}
            date={"2023-10-05-Thu"}
            contentTitle={"새로운 회계연도가 개시될 때까지"}
            contentBody={
              "새로운 회계연도가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 예산안이 의결될 때까지 다음의 목적을 위한 경비는 전년도 예산에 준하여 집행할 수 있다. 국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 대통령은 전시·사변 또는 이에 준하는 국가비상사태에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 안녕질서를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 계엄을 선포할 수 있다."
            }
            imgArray={3}
          />
          <ContentCard
            writer={"jaehyun"}
            date={"2023-10-05-Thu"}
            contentTitle={"새로운 회계연도가 개시될 때까지"}
            contentBody={
              "새로운 회계연도가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 예산안이 의결될 때까지 다음의 목적을 위한 경비는 전년도 예산에 준하여 집행할 수 있다. 국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 대통령은 전시·사변 또는 이에 준하는 국가비상사태에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 안녕질서를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 계엄을 선포할 수 있다."
            }
            imgArray={3}
          />
          <ContentCard
            writer={"jaehyun"}
            date={"2023-10-05-Thu"}
            contentTitle={"새로운 회계연도가 개시될 때까지"}
            contentBody={
              "새로운 회계연도가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 예산안이 의결될 때까지 다음의 목적을 위한 경비는 전년도 예산에 준하여 집행할 수 있다. 국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 대통령은 전시·사변 또는 이에 준하는 국가비상사태에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 안녕질서를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 계엄을 선포할 수 있다."
            }
            imgArray={3}
          />
          <ContentCard
            writer={"jaehyun"}
            date={"2023-10-05-Thu"}
            contentTitle={"새로운 회계연도가 개시될 때까지"}
            contentBody={
              "새로운 회계연도가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 예산안이 의결될 때까지 다음의 목적을 위한 경비는 전년도 예산에 준하여 집행할 수 있다. 국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 대통령은 전시·사변 또는 이에 준하는 국가비상사태에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 안녕질서를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 계엄을 선포할 수 있다."
            }
            imgArray={3}
          />
          <ContentCard
            writer={"jaehyun"}
            date={"2023-10-05-Thu"}
            contentTitle={"새로운 회계연도가 개시될 때까지"}
            contentBody={
              "새로운 회계연도가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 예산안이 의결될 때까지 다음의 목적을 위한 경비는 전년도 예산에 준하여 집행할 수 있다. 국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 대통령은 전시·사변 또는 이에 준하는 국가비상사태에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 안녕질서를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 계엄을 선포할 수 있다."
            }
            imgArray={3}
          />
          <ContentCard
            writer={"jaehyun"}
            date={"2023-10-05-Thu"}
            contentTitle={"새로운 회계연도가 개시될 때까지"}
            contentBody={
              "새로운 회계연도가 개시될 때까지 예산안이 의결되지 못한 때에는 정부는 국회에서 예산안이 의결될 때까지 다음의 목적을 위한 경비는 전년도 예산에 준하여 집행할 수 있다. 국가는 전통문화의 계승·발전과 민족문화의 창달에 노력하여야 한다. 대통령은 전시·사변 또는 이에 준하는 국가비상사태에 있어서 병력으로써 군사상의 필요에 응하거나 공공의 안녕질서를 유지할 필요가 있을 때에는 법률이 정하는 바에 의하여 계엄을 선포할 수 있다."
            }
            imgArray={3}
          />
        </GridLayoutDiv>
      </div>
    </div>
  );
};

export default MainPage;
